print("\ntask1_if20\n")
def task1_if20():
    # Ввести координати точок A, B, C
    a = float(input("Введіть координату точки A: "))
    b = float(input("Введіть координату точки B: "))
    c = float(input("Введіть координату точки C: "))

    # Обчислити відстані від A до B і C
    d_ab = abs(a - b) # Модуль різниці координат
    d_ac = abs(a - c)

    # Порівняти відстані і вивести результат
    if d_ab < d_ac:
        print(f"\nТочка B ближче до A, відстань = {d_ab}\n")
    elif d_ab > d_ac:
        print(f"\nТочка C ближче до A, відстань = {d_ac}\n")
    else:
        print(f"\nТочки B і C рівновіддалені від A, відстань = {d_ab}\n")

task1_if20()


print("\ntask3_20\n")
def task3_20():
    # Імпортувати модуль math для використання константи e і функції sqrt
    import math

    # Ввести кількість членів суми
    k = int(input("Введіть кількість членів суми: "))

    # Ініціалізувати змінну для зберігання суми
    s = 0

    # Використати цикл for для обчислення суми
    for n in range(1, k + 1):
        # Обчислити n-й член суми
        t = math.e ** n / n ** math.sqrt(n / 2)
        # Додати член до суми
        s += t

    # Вивести результат
    print(f"\nСума {k} членів ряду = {s}")

task3_20()